In [10]:
import pandas as pd
import numpy as np

df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                    pd.NaT]})

df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [12]:
df.isnull().sum()

name    0
toy     1
born    2
dtype: int64

#### ravel() flattens the data frame to a single dimensional array

In [32]:
print (df.isnull().values.ravel())
df.isnull().values.ravel().sum()

[False  True  True False False False False False  True]

3

In [2]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [3]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [4]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [5]:
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

In [9]:
df.dropna(subset=['name', 'born'])

     name        toy       born
1  Batman  Batmobile 1940-04-25

# EXERCISES

### 1. Count the number of missing values in each column of the dataset 'marks'.
isnull() returns a dataframe of booleans based on whether the cell is a null or not!

In [34]:
import pandas as pd
marks = pd.read_csv('https://query.data.world/s/HqjNNadqEnwSq1qnoV_JqyRJkc7o6O')
print(marks.isnull().sum())

Prefix         0
Assignment     2
Tutorial      12
Midterm       16
TakeHome       9
Final          5
dtype: int64

### 2. Remove all the rows in the dataset 'marks' having 5 missing values and then print the number of missing values in each column.

In [40]:
import pandas as pd
marks = pd.read_csv('https://query.data.world/s/HqjNNadqEnwSq1qnoV_JqyRJkc7o6O')
#axis = 1 means it will sum all the columns, and hence show you the count of NaNs in each row!
df = df[df.isnull().sum(axis=1) != 5]
print(df.isnull().sum())
#print(#Type your code here to get sum of missing values in each column)

name    0
toy     1
born    2
dtype: int64